---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralDisplayInHiddenViewsColumn
source: html/ff54a457-f002-46a3-ad50-b2d1f753559d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralDisplayInHiddenViewsColumn Property

"Display in Hidden Views"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralDisplayInHiddenViewsColumn { get; }
```